app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"
---
	def index
		@city = City.all

SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@city = City.find(params[:id])

INSERT INTO "cities" ("nombre", "created_at", "updated_at") VALUES (?, ?, ?)  [["nombre", "dsdsdsd"], ["created_at", "2020-11-11 03:57:02.185683"], ["updated_at", "2020-11-11 03:57:02.185683"]]
---
	def create
		@city = City.new(city_params)

		respond_to do |format|
			if @city.save

SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 3]]
---
	def destroy
		city = City.find(params[:id])
		city.destroy

UPDATE "cities" SET "nombre" = ?, "updated_at" = ? WHERE "cities"."id" = ?  [["nombre", "formosa"], ["updated_at", "2020-11-10 23:59:53.696387"], ["id", 12]]
---
  def update
  	respond_to do |format|
  		if @city.update(city_params)

SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_city
    	@city = City.find(params[:id])