app/controllers/routes_controller.rb

	def index
		@routes = Route.all
---
SELECT "routes".* FROM "routes"

	def show
		@routes = Route.find(params[:id])
---
SELECT "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		inicio = params.require(:route).permit(:inicio)
		destino = params.require(:route).permit(:destino)
		a = City.find(inicio)
		b = City.find(destino)
		@route = Route.new(inicio: a, destino: b)

		respond_to do |format|
			if @route.save
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "routes" ("inicio", "destino", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["inicio", "La Plata"], ["destino", "La Plata"], ["created_at", "2020-11-11 15:47:36.089922"], ["updated_at", "2020-11-11 15:47:36.089922"]]

	def destroy
		route = Route.find(params[:id])
		route.destroy
---
SELECT "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "routes" WHERE "routes"."id" = ?  [["id", 4]]