app/controllers/routes_controller.rb

SELECT "cities".* FROM "cities"
---
	def new
		if not City.any?