app/views/routes/_form.html.erb

SELECT "cities".* FROM "cities"
---
          <%= f.label :Ciudad_de_Origen %>
          <%= collection_select( :route, :inicio_city_id, City.all, :id, :nombre, {}, { :multiple => false } ) %>

SELECT "cities".* FROM "cities"
---
          <%= f.label :Ciudad_de_Destino %>
          <%= collection_select( :route, :destino_city_id, City.all, :id, :nombre, {}, { :multiple => false } ) %>